{"cells":[{"cell_type":"markdown","metadata":{"id":"0z3KlfKDn4_K"},"source":["# Лабораторная работа 4. \n","# Сетевые алгоритмы. Методы поиска.\n"]},{"cell_type":"markdown","metadata":{"id":"96Gi_LEvmSVH"},"source":["## Выполнил студент группы БФИ2202 Плешаков Александр Сергеевич\n","***"]},{"cell_type":"markdown","metadata":{"id":"GjdIp8aToKIe"},"source":["### Задание\n","\n","Реализовать методы поиска в соответствии с заданием. Организовать генерацию начального набора случайных данных. Для всех вариантов добавить реализацию добавления, поиска и удаления элементов. Оценить время работы каждого алгоритма поиска и сравнить его со временем работы стандартной функции поиска, используемой в выбранном языке программирования.\n","\n","1.  Бинарный поиск | Бинарное дерево | Фибоначчиев | Интерполяционный\n","\n","2.  Простое рехэширование | Рехэширование с помощью псевдослучайных чисел | Метод цепочек\n","\n","3.  Расставить на стандартной 64-клеточной шахматной доске 8 ферзей так, чтобы ни один из них не находился под боем другого». Подразумевается, что ферзь бьёт все клетки, расположенные по вертикалям, горизонталям и обеим диагоналям\n","Написать программу,  которая находит хотя бы один способ решения задач.\n","\n"]},{"cell_type":"markdown","metadata":{"id":"Wggfn8l7nG72"},"source":["### Выполнение:"]},{"cell_type":"code","execution_count":1,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["[-319, 926, 89, -877, 925, -151, 814, 803, 69, 598, 396, -4, 976, -861, 653, 428, -152, -580, 114, -596, -999, -464, 27, 943, 39, -587, 529, 207, 801, -240, 801, 67, -538, 516, -397, 489, 141, 2, -395, 848, -892, 605, 867, -298, 28, -325, -930, -959, 272, 362, -844, -223, -111, -346, -74, 91, -431, 554, 462, 661, 1000, -269, 428, -402, 678, -317, -343, 415, 572, 4, 353, 762, -141, -78, -956, 567, 298, 504, 766, 49, 541, -634, 17, -298, -359, 39, 893, 244, 903, 594, -953, -251, -69, -550, 933, 659, -8, -388, 846, -941]\n"]}],"source":["import random\n","import time\n","\n","\n","def generate_array(count):\n","   array = [int(random.randint(-999, 1000)) for i in range(count)]\n","   return array\n","\n"]},{"cell_type":"markdown","metadata":{},"source":["***\n","### Бинарный поиск"]},{"cell_type":"code","execution_count":15,"metadata":{"id":"681a95mZnOSa"},"outputs":[{"name":"stdout","output_type":"stream","text":["[-934, -928, -885, -695, -592, -457, -422, -129, 117, 188, 244, 261, 344, 352, 381, 605, 689, 908, 909, 965]\n","--- 5.888938903808594e-05 ms --- Бинарный поиск\n","Элемент 689 найден по индексу 16\n"]}],"source":["generated_array = generate_array(20)\n","generated_array.sort()\n","print(generated_array)\n","\n","def binary_search(arr, target):\n","    left = 0\n","    right = len(arr) - 1\n","\n","    while left <= right:\n","        mid = (left + right) // 2\n","        if arr[mid] == target:\n","            return mid  \n","        elif arr[mid] < target:\n","            left = mid + 1  \n","        else:\n","            right = mid - 1  \n","\n","    return -1  \n","target = int(input())\n","start_time = time.time()\n","result = binary_search(generated_array, target)\n","print(\"--- {0} ms ---\".format(time.time() - start_time), \"Бинарный поиск\")\n","if result != -1:\n","    print(\"Элемент\", target, \"найден по индексу\", result)\n","else:\n","    print(\"Элемент\", target, \"не найден в массиве\")"]},{"cell_type":"markdown","metadata":{},"source":["***\n","### Бинарное дерево поиска"]},{"cell_type":"code","execution_count":null,"metadata":{},"outputs":[],"source":[]},{"cell_type":"markdown","metadata":{"id":"diOb-K7LnO5a"},"source":["### Вывод"]}],"metadata":{"colab":{"provenance":[{"file_id":"1PB29AfCQqtCPpQJrN1jpaKF1cw_5iEo0","timestamp":1679127006477}]},"kernelspec":{"display_name":"Python 3 (ipykernel)","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.9.6"}},"nbformat":4,"nbformat_minor":0}
