{"cells":[{"cell_type":"markdown","metadata":{"id":"0z3KlfKDn4_K"},"source":["# Лабораторная работа 4. \n","# Сетевые алгоритмы. Методы поиска.\n"]},{"cell_type":"markdown","metadata":{"id":"96Gi_LEvmSVH"},"source":["## Выполнил студент группы БФИ2202 Плешаков Александр Сергеевич\n","***"]},{"cell_type":"markdown","metadata":{"id":"GjdIp8aToKIe"},"source":["### Задание\n","\n","Реализовать методы поиска в соответствии с заданием. Организовать генерацию начального набора случайных данных. Для всех вариантов добавить реализацию добавления, поиска и удаления элементов. Оценить время работы каждого алгоритма поиска и сравнить его со временем работы стандартной функции поиска, используемой в выбранном языке программирования.\n","\n","1.  Бинарный поиск | Бинарное дерево | Фибоначчиев | Интерполяционный\n","\n","2.  Простое рехэширование | Рехэширование с помощью псевдослучайных чисел | Метод цепочек\n","\n","3.  Расставить на стандартной 64-клеточной шахматной доске 8 ферзей так, чтобы ни один из них не находился под боем другого». Подразумевается, что ферзь бьёт все клетки, расположенные по вертикалям, горизонталям и обеим диагоналям\n","Написать программу,  которая находит хотя бы один способ решения задач.\n","\n"]},{"cell_type":"markdown","metadata":{"id":"Wggfn8l7nG72"},"source":["### Выполнение:"]},{"cell_type":"code","execution_count":8,"metadata":{},"outputs":[],"source":["import random\n","import time\n","\n","\n","def generate_array(count):\n","   array = [int(random.randint(-999, 1000)) for i in range(count)]\n","   return array\n","\n"]},{"cell_type":"markdown","metadata":{},"source":["***\n","### Бинарный поиск"]},{"cell_type":"code","execution_count":11,"metadata":{"id":"681a95mZnOSa"},"outputs":[{"name":"stdout","output_type":"stream","text":["[-935, -864, -643, -535, -491, -351, -329, -99, -59, 6, 21, 213, 557, 595, 652, 664, 675, 837, 980, 991]\n","--- 0.00010085105895996094 ms --- Бинарный поиск\n","Элемент -864 найден по индексу 1\n"]}],"source":["generated_array = generate_array(20)\n","generated_array.sort()\n","print(generated_array)\n","\n","def binary_search(arr, target):\n","    left = 0\n","    right = len(arr) - 1\n","\n","    while left <= right:\n","        mid = (left + right) // 2\n","        if arr[mid] == target:\n","            return mid  \n","        elif arr[mid] < target:\n","            left = mid + 1  \n","        else:\n","            right = mid - 1  \n","\n","    return -1  \n","target = int(input())\n","start_time = time.time()\n","result = binary_search(generated_array, target)\n","print(\"--- {0} ms ---\".format(time.time() - start_time), \"Бинарный поиск\")\n","if result != -1:\n","    print(\"Элемент\", target, \"найден по индексу\", result)\n","else:\n","    print(\"Элемент\", target, \"не найден в массиве\")"]},{"cell_type":"markdown","metadata":{},"source":["***\n","### Бинарное дерево"]},{"cell_type":"code","execution_count":12,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["[-957, -876, -491, -469, -448, -264, -253, -151, 3, 8, 151, 166, 197, 206, 301, 335, 501, 619, 730, 945]\n","--- 0.00022292137145996094 ms --- Бинарное дерево поиска\n","Элемент -491 найден по индексу 2\n"]}],"source":["class Node:\n","    def __init__(self, key, value):\n","        self.left = None\n","        self.right = None\n","        self.key = key\n","        self.value = value\n","\n","def insert(root, key, value):\n","    if root is None:\n","        return Node(key, value)\n","    if key < root.key:\n","        root.left = insert(root.left, key, value)\n","    elif key > root.key:\n","        root.right = insert(root.right, key, value)\n","    else:\n","        root.value = value\n","    return root\n","\n","def min_value_node(node):\n","    current = node\n","    while current.left is not None:\n","        current = current.left\n","    return current\n","\n","def output(root):\n","    if root:\n","        output(root.left)\n","        print(f\"Key: {root.key}, Value: {root.value}\")\n","        output(root.right)\n","\n","def search(root, key):\n","    if root is None or root.key == key:\n","        return root.value\n","    if root.key < key:\n","        return search(root.right, key)\n","    return search(root.left, key)\n","\n","def delete_node(root, key):\n","    if root is None:\n","        return root\n","    if key < root.key:\n","        root.left = delete_node(root.left, key)\n","    elif key > root.key:\n","        root.right = delete_node(root.right, key)\n","    else:\n","        if root.left is None:\n","            return root.right\n","        elif root.right is None:\n","            return root.left\n","        temp = min_value_node(root.right)\n","        root.key = temp.key\n","        root.right = delete_node(root.right, temp.key)\n","    return root\n","\n","def array_to_binary_tree(arr, start, end):\n","    if start > end:\n","        return None\n","\n","    mid = (start + end) // 2\n","    root = Node(arr[mid], mid)\n","\n","    root.left = array_to_binary_tree(arr, start, mid - 1)\n","    root.right = array_to_binary_tree(arr, mid + 1, end)\n","\n","    return root\n","\n","array = generate_array(20)\n","array.sort()\n","print(array)\n","\n","target = int(input())\n","start_time = time.time()\n","root = array_to_binary_tree(array, 0, len(array) - 1)\n","result = search(root, target)\n","print(\"--- {0} ms ---\".format(time.time() - start_time), \"Бинарное дерево поиска\")\n","print(\"Элемент\", target, \"найден по индексу\", result)"]},{"cell_type":"markdown","metadata":{"id":"diOb-K7LnO5a"},"source":["### Вывод"]}],"metadata":{"colab":{"provenance":[{"file_id":"1PB29AfCQqtCPpQJrN1jpaKF1cw_5iEo0","timestamp":1679127006477}]},"kernelspec":{"display_name":"Python 3 (ipykernel)","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.9.6"}},"nbformat":4,"nbformat_minor":0}
